In [3]:
import pandas as pd

# Data Structure

# 1_Series

A Series is a one-dimensional array-like object containing a sequence of values (of
similar types to NumPy types) and an associated array of data labels, called its index.
The simplest Series is formed from only an array of data:

In [4]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['a']

-5

In [10]:
obj2['d'] = 6

In [11]:
obj2['d', 'a'] = [6, 8]
obj2

d    6
b    7
a    8
c    3
dtype: int64

In [12]:
obj2[['c', 'a', 'd']]

c    3
a    8
d    6
dtype: int64

In [13]:
obj2[obj2 > 0]

d    6
b    7
a    8
c    3
dtype: int64

In [14]:
obj * 2

0     8
1    14
2   -10
3     6
dtype: int64

In [15]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a    2980.957987
c      20.085537
dtype: float64

In [16]:
'b' in obj2

True

In [17]:
'e' in obj2

False

In [18]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [19]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [20]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [22]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [24]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [25]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [26]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [27]:
obj4.name = 'population'

In [28]:
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [29]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [30]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# 2_DataFrame

A DataFrame represents a rectangular table of data and contains an ordered collection
of columns, each of which can be a different value type (numeric, string,
boolean, etc.). The DataFrame has both a row and column index; it can be thought of
as a dict of Series all sharing the same index. Under the hood, the data is stored as one
or more two-dimensional blocks rather than a list, dict, or some other collection of
one-dimensional arrays.

In [31]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [32]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [33]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [34]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                     index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [35]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [36]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [37]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [38]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [39]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [40]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [41]:
frame2['eastern'] = frame2.state == 'ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN    False
two    2001    Ohio  1.7  -1.2    False
three  2002    Ohio  3.6   NaN    False
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [42]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [43]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [44]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [45]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [46]:
pd.DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [47]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [48]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [49]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [50]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

# 3_Index_Objects

Pandas’s Index objects are responsible for holding the axis labels and other metadata
(like the axis name or names). Any array or other sequence of labels you use when
constructing a Series or DataFrame is internally converted to an Index:

In [51]:
obj = pd.Series(range(3), index = ['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [52]:
index[1:]

Index(['b', 'c'], dtype='object')

In [53]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [54]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [55]:
obj2.index is labels

True

In [56]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [57]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [58]:
'Ohio' in frame3.columns

True

In [59]:
2003 in frame3.index

False

In [60]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

# 4_Essential Functionality

## 4.1_Reindexing

An important method on pandas objects is reindex, which means to create a new
object with the data conformed to a new index. Consider an example:

In [61]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [62]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

For ordered data like time series, it may be desirable to do some interpolation or filling
of values when reindexing. The method option allows us to do this, using a
method such as ffill, which forward-fills the values:

In [63]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [64]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [65]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), 
                    index=['a', 'c', 'd'], 
                    columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [66]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [67]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

## 4.2_Dropping Entries from an Axis

Dropping one or more entries from an axis is easy if you already have an index array
or list without those entries. As that can require a bit of munging and set logic, the
drop method will return a new object with the indicated value or values deleted from
an axis:

In [68]:
obj = pd.Series(np.arange(5,), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [69]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [70]:
obj.drop(['d', 'c'])

a    0
b    1
e    4
dtype: int32

In [71]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [72]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [73]:
data.drop('two', axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [74]:
data.drop(['two', 'four'], axis = 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

Many functions, like drop, which modify the size or shape of a Series or DataFrame,
can manipulate an object in-place without returning a new object:

In [75]:
obj.drop('c', inplace = True)
obj

a    0
b    1
d    3
e    4
dtype: int32

## 4.3_Indexing, Selection, and Filtering

Series indexing (obj[...]) works analogously to NumPy array indexing, except you
can use the Series’s index values instead of only integers. Here are some examples of
this:

In [76]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [77]:
obj['b']

1.0

In [78]:
obj[1]

1.0

In [79]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [80]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [81]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [82]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

Slicing with labels behaves differently than normal Python slicing in that the endpoint
is inclusive:

In [83]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [84]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

Indexing into a DataFrame is for retrieving one or more columns either with a single
value or sequence:

In [85]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [86]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [87]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [88]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [89]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

The row selection syntax data[:2] is provided as a convenience. Passing a single element
or a list to the [] operator selects columns.

Another use case is in indexing with a boolean DataFrame, such as one produced by a
scalar comparison:

In [90]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [91]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## 4.4_Selection with loc and iloc

For DataFrame label-indexing on the rows, I introduce the special indexing operators
loc and iloc. They enable you to select a subset of the rows and columns from a
DataFrame with NumPy-like notation using either axis labels (loc) or integers
(iloc).

In [92]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [93]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [94]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [95]:
data.iloc[[1,2], [3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [96]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [97]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

## 4.5_Integer Indexes

Working with pandas objects indexed by integers is something that often trips up
new users due to some differences with indexing semantics on built-in Python data
structures like lists and tuples. For example, you might not expect the following code
to generate an error:

In [98]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [99]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [100]:
ser[:1]

0    0.0
dtype: float64

In [101]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [102]:
ser.iloc[:1]

0    0.0
dtype: float64

## 4.6_Arithmetic and Data Alignment

An important pandas feature for some applications is the behavior of arithmetic
between objects with different indexes. When you are adding together objects, if any
index pairs are not the same, the respective index in the result will be the union of the
index pairs. For users with database experience, this is similar to an automatic outer
join on the index labels. Let’s look at an example:

In [103]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [104]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [105]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [106]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

The internal data alignment introduces missing values in the label locations that don’t
overlap. Missing values will then propagate in further arithmetic computations.

In [107]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                             index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [108]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [109]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [110]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [111]:
df1 = pd.DataFrame({'A' : [1, 2]})

In [112]:
df2 = pd.DataFrame({'B' : [3, 4]})

In [113]:
df1

   A
0  1
1  2

In [114]:
df2

   B
0  3
1  4

In [115]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

## 4.6_Arithmetic methods with fill values

In arithmetic operations between differently indexed objects, you might want to fill
with a special value, like 0, when an axis label is found in one object but not the other:

In [116]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), 
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

df2.loc[1, 'b'] = np.nan
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [117]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [118]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [119]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [120]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [121]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [122]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

## 4.7_Operations between DataFrame and Series

As with NumPy arrays of different dimensions, arithmetic between DataFrame and
Series is also defined. First, as a motivating example, consider the difference between
a two-dimensional array and one of its rows:

In [123]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [124]:
arr[0]

array([0., 1., 2., 3.])

In [125]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [126]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [127]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [128]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [129]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [130]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [131]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [132]:
frame.sub(series3, axis = 'index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## 4.8_Function Application and Mapping

In [133]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    1.182293 -1.543837 -0.993046
Ohio    1.109817  0.153342  0.967087
Texas  -0.118066  1.713647  0.057640
Oregon -1.772581 -0.262450 -1.138655

In [134]:
np.abs(frame)

               b         d         e
Utah    1.182293  1.543837  0.993046
Ohio    1.109817  0.153342  0.967087
Texas   0.118066  1.713647  0.057640
Oregon  1.772581  0.262450  1.138655

In [135]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    2.954874
d    3.257485
e    2.105741
dtype: float64

In [136]:
frame.apply(f, axis = 'columns')

Utah      2.726131
Ohio      0.956475
Texas     1.831714
Oregon    1.510131
dtype: float64

In [137]:
def f(x):
    return pd.Series([x.min(), x.max()], index = ['min', 'max'])
frame.apply(f)

            b         d         e
min -1.772581 -1.543837 -1.138655
max  1.182293  1.713647  0.967087

In [138]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah     1.18  -1.54  -0.99
Ohio     1.11   0.15   0.97
Texas   -0.12   1.71   0.06
Oregon  -1.77  -0.26  -1.14

In [139]:
frame['e'].map(format)

Utah      -0.99
Ohio       0.97
Texas      0.06
Oregon    -1.14
Name: e, dtype: object

## 4.9_Sorting and Ranking

In [140]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [141]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [142]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [143]:
frame.sort_index(axis = 1, ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [144]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [145]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [146]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [147]:
frame.sort_values(by = 'b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [148]:
frame.sort_values(by = ['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [149]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [150]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [151]:
obj.rank(ascending = False, method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [152]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [153]:
frame.rank(axis = 'columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

## 4.10_Axis Indexes with Duplicate Labels

In [154]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [155]:
obj.index.is_unique

False

In [156]:
obj['a']

a    0
a    1
dtype: int64

In [157]:
obj['c']

4

In [158]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.196483 -0.020649  0.601112
a -0.097832 -0.658290  0.248421
b  0.947837 -1.074849 -0.490350
b -1.911696  1.065193  0.002943

In [159]:
df.loc['b']

          0         1         2
b  0.947837 -1.074849 -0.490350
b -1.911696  1.065193  0.002943

# 5_Summarizing and Computing Descriptive Statistics

Pandas objects are equipped with a set of common mathematical and statistical methods.
Most of these fall into the category of reductions or summary statistics, methods
that extract a single value (like the sum or mean) from a Series or a Series of values
from the rows or columns of a DataFrame. Compared with the similar methods
found on NumPy arrays, they have built-in handling for missing data. Consider a
small DataFrame:

In [160]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [161]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [162]:
df.sum(axis = 'columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [163]:
df.mean(axis = 'columns', skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [164]:
df.idxmax()

one    b
two    d
dtype: object

In [165]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [166]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [167]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## 5.1_Correlation and Covariance

Some summary statistics, like correlation and covariance, are computed from pairs of
arguments. Let’s consider some DataFrames of stock prices and volumes obtained
from Yahoo! Finance using the add-on pandas-datareader package. If you don’t
have it installed already, it can be obtained via conda or pip:

In [168]:
import pandas_datareader.data as web

In [169]:
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [170]:
price = pd.DataFrame({ticker: data['Adj Close']
                      for ticker, data in all_data.items()})

volume = pd.DataFrame({ticker: data['Volume']
                       for ticker, data in all_data.items()})

In [171]:
returns = price.pct_change()

In [172]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-08-17 -0.002611 -0.006626  0.006606  0.006798
2020-08-18  0.008333  0.003857  0.005754  0.026759
2020-08-19  0.001255 -0.008646 -0.006067 -0.007102
2020-08-20  0.022190 -0.005572  0.023271  0.022113
2020-08-21  0.051532  0.000081 -0.007270 -0.000841

In [173]:
returns['MSFT'].corr(returns['IBM'])

0.5861665005265612

In [174]:
returns['MSFT'].cov(returns['IBM'])

0.00016409965219802284

In [175]:
returns.MSFT.corr(returns.IBM)

0.5861665005265612

In [176]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.512802  0.705962  0.661288
IBM   0.512802  1.000000  0.586167  0.540435
MSFT  0.705962  0.586167  1.000000  0.784327
GOOG  0.661288  0.540435  0.784327  1.000000

In [177]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000340  0.000152  0.000227  0.000202
IBM   0.000152  0.000258  0.000164  0.000144
MSFT  0.000227  0.000164  0.000304  0.000226
GOOG  0.000202  0.000144  0.000226  0.000274

In [178]:
returns.corrwith(returns.IBM)

AAPL    0.512802
IBM     1.000000
MSFT    0.586167
GOOG    0.540435
dtype: float64

In [179]:
returns.corrwith(volume)

AAPL   -0.072285
IBM    -0.099152
MSFT   -0.046817
GOOG   -0.139809
dtype: float64

## 5.2_Unique Values, Value Counts, and Membership

In [180]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [181]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [182]:
pd.value_counts(obj.values, sort = False)

b    2
c    3
a    3
d    1
dtype: int64

In [183]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [184]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [185]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [186]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [187]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [188]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [189]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [190]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

# Data Loading, Storage, and File Formats

Accessing data is a necessary first step for using most of the tools in this book. I’m
going to be focused on data input and output using pandas, though there are numerous
tools in other libraries to help with reading and writing data in various formats.
Input and output typically falls into a few main categories: reading text files and other
more efficient on-disk formats, loading data from databases, and interacting with network
sources like web APIs.

# 6_Reading and Writing Data in Text Format

Pandas features a number of functions for reading tabular data as a DataFrame
object. Tthough read_csv and read_table are
likely the ones you’ll use the most.

I’ll give an overview of the mechanics of these functions, which are meant to convert
text data into a DataFrame. The optional arguments for these functions may fall into
a few categories:
* Indexing
Can treat one or more columns as the returned DataFrame, and whether to get
column names from the file, the user, or not at all.
* Type inference and data conversion
This includes the user-defined value conversions and custom list of missing value
markers.
* Datetime parsing
Includes combining capability, including combining date and time information
spread over multiple columns into a single column in the result.
* Iterating
Support for iterating over chunks of very large files.
* Unclean data issues
Skipping rows or a footer, comments, or other minor things like numeric data
with thousands separated by commas.

In [191]:
df = pd.read_csv('examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [192]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [193]:
pd.read_csv('examples/ex2.csv', header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [194]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [195]:
names = ['a', 'b', 'c', 'd', 'message']

In [196]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [197]:
parsed = pd.read_csv('examples/csv_mindex.csv', 
                    index_col = ['key1', 'key2'])

parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [198]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [199]:
result = pd.read_table('examples/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [200]:
result = pd.read_csv('examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [201]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [202]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [203]:
sentinels = {'messae': ['foo', 'NA'], 'something': ['two']}

In [204]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

## 6.1_Reading Text Files in Pieces

When processing very large files or figuring out the right set of arguments to correctly
process a large file, you may only want to read in a small piece of a file or iterate
through smaller chunks of the file.

In [205]:
pd.options.display.max_rows = 10

In [206]:
result = pd.read_csv('examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [207]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [208]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)
chunker

## 6.2_Writing Data to Text Format

In [209]:
data = pd.read_csv('examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [210]:
data.to_csv('examples/out.csv')

In [211]:
import sys

In [212]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [213]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [214]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [215]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [216]:
dates = pd.date_range('1/1/2000', periods=7)

In [217]:
ts = pd.Series(np.arange(7), index=dates)

In [218]:
ts.to_csv('examples/tseries.csv')

In [219]:
!cat examples/tseries.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

## 6.3_Working with Delimited Formats

In [220]:
import csv

In [221]:
f = open('examples/ex7.csv')
reader = csv.reader(f)

It’s possible to load most forms of tabular data from disk using functions like pan
das.read_table. In some cases, however, some manual processing may be necessary.
It’s not uncommon to receive a file with one or more malformed lines that trip up
read_table. To illustrate the basic tools, consider a small CSV file

In [222]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [223]:
for line in reader:
    print(line)

In [224]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [225]:
header, values = lines[0], lines[1:]

In [226]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

## 6.4_JSON Data

JSON (short for JavaScript Object Notation) has become one of the standard formats
for sending data by HTTP request between web browsers and other applications. It is
a much more free-form data format than a tabular text form like CSV. Here is an
example:

In [227]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [228]:
import json

In [229]:
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [230]:
asjson = json.dumps(result)

In [231]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [232]:
!cat examples/example.json

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [233]:
data = pd.read_json('examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [234]:
print(data.to_json)

<bound method NDFrame.to_json of    a  b  c
0  1  2  3
1  4  5  6
2  7  8  9>

In [235]:
print(data.to_json(orient = 'records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

## 6.5_XML and HTML: Web Scraping

Python has many libraries for reading and writing data in the ubiquitous HTML and
XML formats. Examples include lxml, Beautiful Soup, and html5lib. While lxml is
comparatively much faster in general, the other libraries can better handle malformed
HTML or XML files.
pandas has a built-in function, read_html, which uses libraries like lxml and Beautiful
Soup to automatically parse tables out of HTML files as DataFrame objects. To
show how this works, I downloaded an HTML file (used in the pandas documentation)
from the United States FDIC government agency showing bank failures.1 First,
you must install some additional libraries used by read_html:

In [236]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')
len(tables)

1

In [237]:
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [238]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

## 6.6_Parsing XML with lxml.objectify

XML (eXtensible Markup Language) is another common structured data format supporting
hierarchical, nested data with metadata. The book you are currently reading
was actually created from a series of large XML documents.
Earlier, I showed the pandas.read_html function, which uses either lxml or Beautiful
Soup under the hood to parse data from HTML. XML and HTML are structurally
similar, but XML is more general. Here, I will show an example of how to use lxml to
parse data from a more general XML format.
The New York Metropolitan Transportation Authority (MTA) publishes a number of
data series about its bus and train services. Here we’ll look at the performance data,
which is contained in a set of XML files. Each train or bus service has a different file
(like Performance_MNR.xml for the Metro-North Railroad) containing monthly data
as a series of XML records that look like this:

In [239]:
from lxml import objectify

In [240]:
perf = pd.DataFrame(data)

In [241]:
perf.head()

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [242]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [243]:
root

In [244]:
root.get('href')

'http://www.google.com'

In [245]:
root.text

'Google'

# 7_Binary Data Formats

One of the easiest ways to store data (also known as serialization) efficiently in binary
format is using Python’s built-in pickle serialization. pandas objects all have a
to_pickle method that writes the data to disk in pickle format:

In [246]:
frame = pd.read_csv('examples/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [247]:
frame.to_pickle('examples/frame_pickle')

In [248]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## 7.1_Using HDF5 Format

HDF5 is a well-regarded file format intended for storing large quantities of scientific
array data. It is available as a C library, and it has interfaces available in many other
languages, including Java, Julia, MATLAB, and Python. The “HDF” in HDF5 stands
for hierarchical data format. Each HDF5 file can store multiple datasets and supporting
metadata. Compared with simpler formats, HDF5 supports on-the-fly compression
with a variety of compression modes, enabling data with repeated patterns to be
stored more efficiently. HDF5 can be a good choice for working with very large datasets
that don’t fit into memory, as you can efficiently read and write small sections of
much larger arrays.
While it’s possible to directly access HDF5 files using either the PyTables or h5py
libraries, pandas provides a high-level interface that simplifies storing Series and
DataFrame object. The HDFStore class works like a dict and handles the low-level
details:

In [249]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [250]:
store = pd.HDFStore('mydata.h5')

In [251]:
store['obj1'] = frame

In [252]:
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [253]:
store['obj1']

           a
0   0.341067
1  -0.387447
2  -1.609948
3  -0.221251
4   0.763956
..       ...
95  0.980197
96  0.509203
97  2.599664
98 -0.099605
99 -0.270189

[100 rows x 1 columns]

In [254]:
store.put('obj2', frame, format = 'table')
store.select('obj2', where = ['index >= 10 and index <= 15'])
store.close()

In [255]:
frame.to_hdf('mydata.h5', 'obj3', format = 'table')

In [256]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  0.341067
1 -0.387447
2 -1.609948
3 -0.221251
4  0.763956

## 7.2_Reading Microsoft Excel Files

Pandas also supports reading tabular data stored in Excel 2003 (and higher) files
using either the ExcelFile class or pandas.read_excel function. Internally these
tools use the add-on packages xlrd and openpyxl to read XLS and XLSX files, respectively.
You may need to install these manually with pip or conda.

In [257]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [258]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [259]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [260]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [261]:
frame.to_excel(writer, 'Sheet1')

In [262]:
writer.save()

In [263]:
frame.to_excel('examples/ex2.xlsx')

# 8_Interacting with Web APIs

Many websites have public APIs providing data feeds via JSON or some other format.
There are a number of ways to access these APIs from Python; one easy-to-use
method that I recommend is the requests package.

In [264]:
import requests

In [265]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [266]:
resp = requests.get(url)
resp

In [267]:
data = resp.json()

In [268]:
data[0]['title']

'BUG: Vectorized string operations are slower than for-loops'

In [269]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])
issues

,number,title,labels,state
0,35864,BUG: Vectorized string operations are slower t...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
1,35863,KeyError using custom agg function,"[{'id': 34444536, 'node_id': 'MDU6TGFiZWwzNDQ0...",open
2,35861,REF: make window _apply_blockwise actually blo...,[],open
3,35860,DEPR: Deprecate as_index in groupby,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,35858,BUG: Datetime MultiIndex Regression,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
...,...,...,...,...
25,35816,BUG: read_excel doesn't honor dtype for index,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,35814,TST: Fix test_parquet failures for pyarrow 1.0,"[{'id': 685114413, 'node_id': 'MDU6TGFiZWw2ODU...",open
27,35811,QST: Series.transform with a dictionary,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
28,35807,BUG: Issue with Pandas df.str.split with expand,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
29,35805,Performance regression in index_object.IndexEq...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open

# 9_Interacting with Databases

In a business setting, most data may not be stored in text or Excel files. SQL-based
relational databases (such as SQL Server, PostgreSQL, and MySQL) are in wide use,
and many alternative databases have become quite popular. The choice of database is
usually dependent on the performance, data integrity, and scalability needs of an
application.
Loading data from SQL into a DataFrame is fairly straightforward, and pandas has
some functions to simplify the process. As an example, I’ll create a SQLite database
using Python’s built-in sqlite3 driver:

In [270]:
import sqlite3

In [273]:
query = """
CREATE TABLE test2(a VARCHAR(20), b VARCHAR(20),c REAL, d INTEGER);"""

In [274]:
con = sqlite3.connect('mydata.sqlite')
con.execute(query)

In [275]:
con.commit()

In [276]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [277]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [278]:
con.executemany(stmt, data)

In [279]:
con.commit()

In [280]:
cursor = con.execute('select * from test1')

In [281]:
rows = cursor.fetchall()
rows

[]

In [282]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [283]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

Empty DataFrame
Columns: [a, b, c, d]
Index: []

In [284]:
import sqlalchemy as sqla

In [285]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [286]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5

# Data Cleaning and Preparation

# 10_Handling Missing Data

Missing data occurs commonly in many data analysis applications. One of the goals
of pandas is to make working with missing data as painless as possible. For example,
all of the descriptive statistics on pandas objects exclude missing data by default.
The way that missing data is represented in pandas objects is somewhat imperfect,
but it is functional for a lot of users. For numeric data, pandas uses the floating-point
value NaN (Not a Number) to represent missing data. We call this a sentinel value that
can be easily detected:

In [287]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [288]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [289]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## 10.1_Filtering Out Missing Data

There are a few ways to filter out missing data. While you always have the option to
do it by hand using pandas.isnull and boolean indexing, the dropna can be helpful.
On a Series, it returns the Series with only the non-null data and index values:

In [290]:
from numpy import nan as NA

In [291]:
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [292]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [293]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [294]:
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [295]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [296]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [297]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [298]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [299]:
df = pd.DataFrame(np.random.randn(7, 3))

In [300]:
df.iloc[:4, 1] = NA

In [301]:
df.iloc[2, 2] = NA
df

          0         1         2
0 -1.168866       NaN -0.563379
1  0.839345       NaN -1.638395
2 -0.314141       NaN       NaN
3 -0.726830       NaN  1.695770
4 -0.904760 -0.350741  0.527157
5  0.916702  0.662430  1.148671
6  0.318305  0.833470 -1.269128

In [302]:
df.dropna()

          0         1         2
4 -0.904760 -0.350741  0.527157
5  0.916702  0.662430  1.148671
6  0.318305  0.833470 -1.269128

In [303]:
df.dropna(thresh = 2)

          0         1         2
0 -1.168866       NaN -0.563379
1  0.839345       NaN -1.638395
3 -0.726830       NaN  1.695770
4 -0.904760 -0.350741  0.527157
5  0.916702  0.662430  1.148671
6  0.318305  0.833470 -1.269128

## 10.2_Filling In Missing Data

Rather than filtering out missing data (and potentially discarding other data along
with it), you may want to fill in the “holes” in any number of ways. For most purposes,
the fillna method is the workhorse function to use. Calling fillna with a
constant replaces missing values with that value:

In [304]:
df.fillna(0)

          0         1         2
0 -1.168866  0.000000 -0.563379
1  0.839345  0.000000 -1.638395
2 -0.314141  0.000000  0.000000
3 -0.726830  0.000000  1.695770
4 -0.904760 -0.350741  0.527157
5  0.916702  0.662430  1.148671
6  0.318305  0.833470 -1.269128

In [305]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.168866  0.500000 -0.563379
1  0.839345  0.500000 -1.638395
2 -0.314141  0.500000  0.000000
3 -0.726830  0.500000  1.695770
4 -0.904760 -0.350741  0.527157
5  0.916702  0.662430  1.148671
6  0.318305  0.833470 -1.269128

In [306]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -1.168866  0.000000 -0.563379
1  0.839345  0.000000 -1.638395
2 -0.314141  0.000000  0.000000
3 -0.726830  0.000000  1.695770
4 -0.904760 -0.350741  0.527157
5  0.916702  0.662430  1.148671
6  0.318305  0.833470 -1.269128

In [307]:
df = pd.DataFrame(np.random.randn(6, 3))

In [308]:
df.iloc[2:, 1] = NA

In [309]:
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.639639  0.768885 -1.749742
1  0.426522 -1.349880  0.084624
2  0.959440       NaN  0.619054
3  0.852906       NaN -0.855712
4  0.543855       NaN       NaN
5 -0.648755       NaN       NaN

In [310]:
df.fillna(method='ffill')

          0         1         2
0  0.639639  0.768885 -1.749742
1  0.426522 -1.349880  0.084624
2  0.959440 -1.349880  0.619054
3  0.852906 -1.349880 -0.855712
4  0.543855 -1.349880 -0.855712
5 -0.648755 -1.349880 -0.855712

In [311]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.639639  0.768885 -1.749742
1  0.426522 -1.349880  0.084624
2  0.959440 -1.349880  0.619054
3  0.852906 -1.349880 -0.855712
4  0.543855       NaN -0.855712
5 -0.648755       NaN -0.855712

In [312]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [313]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 11_Data Transformation

## 11.1_Removing Duplicates

In [314]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [315]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [316]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [317]:
data['v1'] = range(7)

In [318]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [319]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## 11.2_Transforming Data Using a Function or Mapping

In [320]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [321]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [322]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

## 11.3_Replacing Values

Filling in missing data with the fillna method is a special case of more general value
replacement. As you’ve already seen, map can be used to modify a subset of values in
an object but replace provides a simpler and more flexible way to do so. Let’s consider
this Series:

In [323]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [324]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [325]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [326]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [327]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## 11.4_Renaming Axis Indexes

Like values in a Series, axis labels can be similarly transformed by a function or mapping
of some form to produce new, differently labeled objects. You can also modify
the axes in-place without creating a new data structure. Here’s a simple example:

In [328]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [329]:
transform = lambda x: x[:4].upper()

In [330]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [331]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [332]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [333]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [334]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## 11.5_Discretization and Binning

Continuous data is often discretized or otherwise separated into “bins” for analysis.
Suppose you have data about a group of people in a study, and you want to group
them into discrete age buckets:

In [336]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [337]:
bins = [18, 25, 35, 60, 100]

In [338]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

The object pandas returns is a special Categorical object. The output you see
describes the bins computed by pandas.cut. You can treat it like an array of strings
indicating the bin name; internally it contains a categories array specifying the distinct
category names along with a labeling for the ages data in the codes attribute:

In [340]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [342]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [343]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

Note that pd.value_counts(cats) are the bin counts for the result of pandas.cut.

Consistent with mathematical notation for intervals, a parenthesis means that the side
is open, while the square bracket means it is closed (inclusive). You can change which
side is closed by passing right=False:

In [344]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [345]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [346]:
pd.cut(ages, bins, labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [348]:
data = np.random.rand(20)
data

array([0.04169521, 0.34345842, 0.7547209 , 0.28000081, 0.64925606,
       0.81952728, 0.77210545, 0.33223704, 0.21829691, 0.10571474,
       0.51111437, 0.49395229, 0.6906303 , 0.33193302, 0.81172991,
       0.87552133, 0.86719621, 0.226543  , 0.09785902, 0.6885293 ])

In [349]:
pd.cut(data, 4, precision = 2)

[(0.041, 0.25], (0.25, 0.46], (0.67, 0.88], (0.25, 0.46], (0.46, 0.67], ..., (0.67, 0.88], (0.67, 0.88], (0.041, 0.25], (0.041, 0.25], (0.67, 0.88]]
Length: 20
Categories (4, interval[float64]): [(0.041, 0.25] < (0.25, 0.46] < (0.46, 0.67] < (0.67, 0.88]]

The precision=2 option limits the decimal precision to two digits.

A closely related function, qcut, bins the data based on sample quantiles. Depending
on the distribution of the data, using cut will not usually result in each bin having the
same number of data points. Since qcut uses sample quantiles instead, by definition
you will obtain roughly equal-size bins:

In [351]:
data = np.random.randn(1000) # Normally distributed
data

array([ 2.02913451e-01, -3.69301370e-01,  3.37525325e-01, -7.27915429e-01,
       -1.69172164e-02,  9.12059507e-01, -9.02025847e-01,  1.84419601e+00,
        1.85054280e+00,  1.84296565e-01,  7.45761044e-01,  6.27851831e-01,
       -1.16563169e+00, -1.37487414e-01,  7.16542313e-01, -2.92619459e-01,
       -4.01880560e-01,  1.37802930e+00,  2.78769719e-01, -8.30698045e-01,
        1.42507997e+00, -5.67732861e-01,  3.34160792e-01,  9.85170223e-01,
        5.56955550e-01,  3.29138452e-01, -5.07327675e-01,  1.88360729e+00,
        5.05287769e-01,  1.24012609e+00, -4.58796039e-01,  1.48160533e+00,
        4.70909568e-01,  3.73447479e-01,  2.84414645e-01,  9.54342661e-01,
        2.13880112e+00, -1.37836787e+00, -5.24219656e-01, -1.70169171e+00,
        1.61361083e-01, -7.71384099e-01,  5.78096595e-02, -9.43728588e-01,
        1.34470520e+00, -1.15645684e+00, -1.80548470e+00,  1.58199812e+00,
       -1.04209754e+00, -7.92453339e-01,  6.06816921e-01, -3.95567387e-01,
       -2.13115182e+00, -7.96444616e-01, -8.52692339e-01, -3.62678188e-01,
        6.02146638e-01, -6.82096809e-02,  9.28103273e-03,  1.32040045e+00,
       -4.53050088e-01, -1.09902671e+00,  2.13150770e-01,  2.45366262e-01,
       -5.46660119e-01,  3.71435568e-01, -1.51706303e-01, -8.09837018e-01,
        9.24126000e-01, -2.72936903e-01,  1.22869612e+00,  9.09224662e-01,
       -1.78779388e+00,  3.93339531e-01,  9.08936900e-01,  9.48943064e-01,
       -1.76584783e+00, -3.16342485e-01,  2.19984203e-01,  1.32872615e+00,
        1.05904472e+00, -1.05500716e+00,  1.31950435e+00, -7.82261919e-01,
        4.82972789e-01,  1.34646566e+00, -4.45182133e-01,  6.69484665e-01,
       -1.26985547e+00,  4.31358792e-01, -1.66003281e+00,  5.50759108e-01,
       -6.55179458e-03,  1.17476310e+00,  2.91527880e-01,  8.80064302e-01,
       -4.18341132e-01, -1.04207449e-01, -2.10025848e+00, -1.03055167e+00,
        2.61537088e-01, -6.01900550e-01, -7.03799184e-01, -2.29917697e-01,
        1.13202054e+00, -3.20901679e+00,  5.46101496e-01, -1.54552753e+00,
        1.35205137e+00, -9.42281537e-01, -9.62471989e-01, -1.40144718e-01,
        1.05815656e+00,  1.52965518e+00,  1.00886193e+00,  6.84508069e-01,
        3.72456052e-01, -1.05358810e+00, -6.90814027e-01,  1.13798000e+00,
        8.92103083e-01,  2.22921808e+00, -5.80980154e-01,  7.27133088e-01,
       -1.10322500e-01,  1.67401485e-01,  1.43516907e+00, -9.24148592e-01,
        1.12234966e+00,  1.50050355e+00,  8.47743310e-01,  3.06289067e-01,
        1.57249644e+00,  8.21260080e-01, -2.34259664e+00, -1.41612506e+00,
        1.05145513e+00, -6.58069534e-02, -3.73089147e-01, -4.63132766e-01,
        1.06193147e+00, -1.30916003e+00, -2.30954864e-01,  6.11412680e-01,
        1.63696817e-01,  6.19887297e-01, -1.59803361e-02,  9.62144186e-01,
        1.43311749e+00, -1.48395203e+00,  1.59899747e-01,  1.12045451e+00,
        1.54886480e+00,  8.26769694e-01,  1.11311971e+00,  1.48078664e+00,
        2.85302366e-02, -1.78070578e+00, -6.55952211e-02, -2.35179513e-01,
       -2.72185246e-02,  2.18578887e+00,  4.97411114e-01,  1.94222086e+00,
        7.64081655e-01, -6.44728593e-01,  1.59471274e-02,  1.16030517e+00,
       -9.11684399e-01, -3.87834716e-02, -5.15389179e-01, -1.71675702e-01,
       -7.17386634e-01, -8.98750185e-01,  4.69824105e-01,  8.64203483e-01,
        7.02049731e-01, -5.16793787e-01,  1.34983546e+00, -8.28356682e-01,
       -5.59675967e-01,  8.96726070e-01,  2.03517629e+00, -8.78408495e-01,
        3.42750474e-01,  1.33560972e-01,  1.20017032e+00,  2.43994755e+00,
        1.09861709e+00, -2.14897580e-01,  6.46305661e-01, -9.13147074e-01,
       -1.10829903e+00, -4.51166542e-01,  9.82407838e-01,  1.02774694e+00,
        1.13694235e+00, -1.14585257e+00,  2.53996620e-01,  3.27501169e-02,
       -1.40566727e+00,  2.44573007e-01, -8.55249985e-01, -8.01807185e-02,
        2.05407714e-01, -2.05922031e-01, -1.45986457e+00, -3.57210579e-01,
       -1.23969978e-01,  1.17162743e+00, -2.54925836e+00, -1.03573059e+00,
       -4.45586618e-01, -1.15074217e+00, -8.44487754e-01, -7.65067985e-01,
        7.41056583e-02,  1.06593427e+00,  9.86985782e-01,  9.05897780e-01,
       -2.26224757e+00, -5.80108820e-01, -9.47564065e-01, -1.34799387e+00,
        1.67066312e+00,  1.04097028e+00,  1.27576544e+00,  1.53031989e+00,
       -8.82055887e-01,  4.09729362e-01, -1.80633051e+00, -1.46015227e+00,
        2.32491632e-02, -1.49853387e+00, -1.89878949e+00,  2.05840522e+00,
        1.95709571e-01,  1.25274944e-01, -1.12086565e+00,  5.10387282e-02,
       -1.17728701e+00, -2.03264526e+00,  3.39927576e-01, -4.72506756e-01,
        4.32694416e-02,  1.59747339e-01, -1.55622155e+00,  7.27147966e-01,
       -7.37401743e-01, -4.38127048e-01, -3.40434615e-01, -1.01343632e+00,
        1.11876058e+00, -2.22107710e-01, -2.36409933e+00, -7.40121142e-01,
       -5.65370589e-02, -6.61929010e-01,  3.11686594e-02,  2.57890092e-01,
       -2.76570262e-01, -1.63533713e+00,  3.67275252e-01,  1.34687821e+00,
        2.93307831e-01,  2.54564842e+00, -3.01104165e-01, -2.09560307e+00,
        6.71208293e-01, -9.61943126e-01,  1.10306844e+00, -1.62591355e-01,
        1.17706309e+00, -1.31227953e+00, -8.79447813e-01, -2.48918772e+00,
       -5.67414141e-01,  9.74975305e-01,  1.15831091e+00, -6.42823835e-01,
       -7.00309968e-01, -1.63114763e+00, -3.38929132e-01, -3.10316146e-01,
        2.65917909e+00,  7.18317754e-01,  1.34223963e+00, -1.08809756e+00,
       -4.64490880e-01,  5.52664397e-01, -2.65425907e-01, -2.47035754e+00,
        1.29751131e+00,  1.52327290e+00,  2.20326573e-01,  5.12492201e-01,
        2.92173963e-01, -7.59577819e-01,  6.22829539e-01,  1.03007727e+00,
       -7.29493949e-01, -3.71613438e-01,  1.61711620e+00, -7.99231199e-01,
       -3.16510005e-01,  1.33298506e+00,  2.94082820e-01, -4.21289355e-02,
       -1.41154699e+00, -1.08381663e+00,  5.74532692e-01, -2.17813124e-01,
        4.10160161e-01, -2.96719143e-01,  4.32094499e-01,  4.71289480e-01,
        6.67704492e-02,  6.24224500e-02,  4.71672438e-01, -9.59778395e-01,
       -1.03652699e+00,  7.67471411e-01,  6.78499063e-01,  1.07399554e+00,
       -1.63361393e+00, -8.27589826e-01, -5.13361769e-01, -8.78693012e-01,
       -7.54019014e-01,  5.86322191e-01, -6.83354369e-01,  1.90486672e-01,
       -8.16782726e-01,  5.19826860e-01,  7.53816479e-01, -6.65412607e-01,
        1.11215656e+00,  1.28933373e+00, -8.49407399e-02,  4.12838108e-01,
       -1.75242818e-01,  4.33021168e-01,  1.31946978e+00, -6.96748343e-01,
       -4.62720395e-01,  7.19107650e-01, -1.38236689e+00,  2.46535799e-01,
       -2.28959918e-01, -4.69511887e-01,  2.30521731e+00, -2.01047348e-01,
        1.40881888e-01,  5.70048312e-01,  1.63778749e-01, -1.10645579e+00,
       -3.99570271e-01,  3.74574108e-01,  4.98954170e-01,  1.09400174e-01,
       -7.59087725e-02,  8.28642101e-01, -1.29225956e+00, -6.51390219e-01,
        4.40238436e-01,  1.58911988e+00, -1.00824126e+00, -6.38245394e-02,
        7.73805805e-01,  1.47146101e+00,  2.48417313e-02, -4.09351717e-01,
        4.87885554e-01,  5.41557679e-02, -1.36931624e+00,  1.12991591e+00,
       -8.92457480e-01, -1.07287204e+00,  5.37006743e-01, -1.79002315e+00,
       -4.46749242e-01, -7.11457641e-01, -3.13154260e+00, -8.36205029e-01,
       -1.21450820e+00,  4.21583286e-01, -6.18158569e-02,  9.10390170e-01,
       -8.75407099e-01,  7.58624529e-01, -1.11387518e-01,  2.19682851e+00,
        1.04826121e+00, -1.73994621e+00, -2.63362886e-01, -2.08296453e+00,
       -1.20881774e-01,  4.66178551e-01,  1.01383230e+00, -5.54329011e-02,
        9.13536286e-03,  1.45311449e+00,  1.32248832e+00,  4.92762123e-01,
        3.18632181e-01, -4.39591650e-01,  1.47331079e+00,  6.83504596e-02,
       -1.12163395e+00, -2.61338269e+00, -1.37678128e+00, -7.17820751e-01,
       -6.35475182e-01, -1.58115822e-02,  1.41872418e+00, -1.19112701e+00,
       -5.88821166e-01,  5.35738292e-01,  8.52062078e-01, -1.19404193e+00,
        1.40445085e+00, -6.38088807e-01, -1.53322873e-01, -6.74176361e-01,
       -3.65331276e-01, -1.65915815e+00, -5.39031995e-01, -2.08095977e-01,
        4.66813795e-01, -1.06657812e+00,  8.99197676e-01, -8.96870095e-01,
        2.14894092e+00,  1.02215173e+00, -1.42909252e+00,  2.03348780e+00,
        5.82654313e-01,  3.64223353e-02, -6.52206153e-01, -6.29107900e-01,
       -1.26834364e-01, -5.80869613e-02, -1.46581312e+00, -9.42934359e-01,
        1.26511262e+00, -1.28180446e+00,  6.66931663e-01,  1.40953362e+00,
       -2.08124585e+00, -1.03251591e+00, -1.32651638e-01, -1.96635103e-01,
        9.11268843e-01,  1.03735771e-01, -5.57885537e-01, -2.01343010e-01,
       -3.17799068e-01, -4.88080810e-01,  1.05627294e+00,  5.49201374e-01,
       -1.41494507e-01, -4.06511210e-02, -7.62174171e-01, -2.60891105e-01,
       -4.08004147e-01, -2.08921040e+00, -8.36340461e-01,  8.81098363e-01,
        6.77804094e-01,  1.19540698e+00,  2.58426567e-01,  2.29420979e-01,
        2.03205870e-01,  2.00702125e+00, -1.59342571e+00,  7.46523187e-02,
        4.52675473e-01,  2.44125067e-01, -5.09416818e-01, -9.48482093e-01,
        1.22826175e+00, -1.46517230e+00,  5.43480990e-01, -7.85701493e-01,
       -6.74509392e-02, -5.67371488e-01, -1.79542557e-01, -5.40342651e-01,
        2.33955728e+00, -1.05016947e+00,  7.34730388e-01, -6.74124876e-01,
        1.75351777e+00, -6.28480640e-01, -7.65480790e-01, -1.13749719e+00,
       -2.35963629e+00, -8.88842741e-01, -2.38033565e-01,  3.23464442e-01,
        1.52032245e+00, -1.93268670e+00,  1.79052292e-01, -1.23739494e+00,
       -1.67194148e-01, -9.35273016e-01,  9.76583290e-01,  1.65918991e+00,
       -7.66744162e-01,  4.16831120e-01,  1.49914136e+00,  3.00940860e-01,
        2.47542053e-02,  3.02719292e-01,  2.48363252e-01, -2.43279926e-01,
        1.09903208e+00, -1.10956231e-01, -1.49221360e+00, -6.14449325e-01,
        1.15643061e-01, -1.25814671e+00, -6.26687922e-01,  1.03348959e+00,
       -2.33904878e+00,  6.66489085e-01,  1.89256769e+00, -3.38040701e-01,
       -1.09460131e+00, -1.16435046e-01,  1.65971121e+00,  1.38187528e+00,
        3.97663625e-01,  1.47394083e+00, -7.34642114e-01, -5.92213847e-01,
       -2.79718444e-01, -1.32351512e-01,  7.56760831e-01, -5.28352931e-01,
        7.16469349e-01,  7.39442274e-01,  1.50344576e-01, -1.04559604e+00,
       -7.05518539e-01, -2.17799960e-01, -2.35881653e+00, -1.78100604e-01,
       -2.49587901e-01, -8.33390810e-01,  1.47109245e+00, -8.12836993e-01,
        8.40525059e-01, -1.61704300e-01, -9.92114006e-01,  2.27950304e-01,
        7.90561224e-01,  7.01080004e-01,  1.38838331e+00, -2.78304683e-01,
       -9.30249095e-01,  2.34198884e-01, -4.45078550e-01,  1.35238223e-01,
        1.57099618e+00, -1.62332501e-01, -6.90758157e-01, -5.14651457e-01,
       -1.17312260e+00, -9.33085141e-01, -5.40486603e-01,  1.67026331e-01,
        1.16510686e+00, -1.10094380e+00, -4.06871501e-01, -7.74099352e-01,
        1.23262196e+00,  5.11451823e-01, -8.04427971e-01, -1.77860652e+00,
       -6.46611420e-01,  2.17337472e+00, -9.18975620e-01, -1.02401527e+00,
        1.82247825e-01,  7.84918499e-01, -1.72543350e+00, -2.40768224e-01,
        1.41529356e-03, -1.44241107e+00,  2.44264693e-01,  6.68949797e-03,
        6.11962494e-01, -8.93029506e-01, -4.83941990e-01, -7.45488753e-01,
        1.24789132e+00,  3.98757874e-01,  6.34654221e-01, -2.13042163e+00,
        1.05331200e-01,  3.93686342e-01, -5.38109144e-01,  3.64975066e-01,
       -1.71621768e-01, -9.63357176e-01,  2.82844371e-01, -7.22739418e-01,
       -3.82070499e-01, -1.74196401e-02,  1.37364509e+00,  9.06291596e-01,
        1.22339731e+00,  2.46653045e-01, -4.27776803e-01, -8.75605867e-01,
        6.40496066e-01, -5.65797372e-01, -4.86205793e-01,  7.07979053e-02,
       -1.27317620e+00,  2.62474876e+00, -7.05149549e-01, -6.45604640e-02,
       -1.46821166e+00,  9.12360317e-02, -4.68313836e-01, -7.88316333e-02,
        1.45463352e+00,  3.50190797e-01, -2.54522862e-01, -6.85753649e-01,
        4.35970038e-01,  1.52337961e+00,  1.69148597e+00, -2.40800077e-01,
       -4.44560373e-01, -1.97111646e-01, -2.37030046e-01, -7.63149798e-01,
        2.02200949e+00, -9.70971083e-02,  1.48117110e+00,  5.10524494e-01,
        7.82227215e-01, -2.00983225e-01,  1.42354858e-01,  5.24970468e-02,
       -1.55859160e+00,  1.08362203e+00,  1.18324293e+00,  5.42730036e-01,
        1.36387126e-01,  4.65661465e-01,  3.38512129e-01, -1.30435293e-01,
        8.12878037e-01,  1.59955294e-01, -5.80753469e-01,  1.77535791e+00,
       -6.26857049e-01, -1.55918250e+00,  1.45279474e+00, -2.17268375e-01,
       -4.73475463e-01,  1.05975449e-01,  8.61968740e-01,  6.97695813e-01,
       -1.35090853e+00, -8.51009399e-01,  1.09536260e+00,  1.28927672e+00,
        1.01421432e+00,  1.32565501e+00, -2.18413309e+00, -8.00645812e-02,
        1.88956610e-01,  5.07464853e-01,  4.88243939e-01, -4.33153464e-01,
        2.01135893e+00,  1.17731020e+00, -5.48019106e-01, -1.10425639e+00,
        1.37504535e-01, -1.64186246e+00,  2.90452014e-01, -6.35732566e-01,
       -1.10217129e+00, -1.05962149e+00,  7.82914514e-01, -1.09819370e-01,
        4.17310471e-01, -4.44800610e-01, -1.49805925e-01,  9.51400670e-02,
        1.61135720e+00, -8.90079327e-01,  1.68811652e+00, -6.10672511e-01,
        8.32520980e-01, -7.84944712e-01, -5.43817440e-01,  9.97387165e-01,
       -2.29145517e-01, -5.25458778e-02, -7.55164613e-01,  1.64374086e-01,
        4.81118043e-01,  2.27901933e-01,  5.01627932e-01,  1.64491943e+00,
        1.26425274e+00, -5.01906359e-01, -6.65981016e-02,  2.81908167e-01,
       -4.86298700e-01, -8.65571336e-01,  1.38508276e+00, -5.31767169e-01,
        1.52442232e-01,  3.99273904e-01,  9.74146493e-01, -4.45796903e-01,
       -1.68963717e+00, -1.14928929e-01,  1.26936464e-01,  9.21331184e-01,
       -4.26776881e-01, -3.47033025e-01,  5.89125169e-01,  1.19398410e-01,
       -6.93880713e-01,  1.05946980e+00,  1.72081611e+00, -1.36028443e-01,
       -2.53777484e-01,  1.86323298e-01, -7.37394402e-01, -7.81702423e-01,
        1.97656793e+00,  4.02087759e-01, -1.19731101e-02, -1.53654720e+00,
        3.20569390e-01,  1.00749631e+00,  6.99521355e-01,  1.26530958e-01,
        5.29760536e-02, -1.70885494e+00, -8.35591751e-01, -8.99345367e-02,
        6.73273791e-01, -2.02085735e-01,  1.54597150e+00,  3.35976291e-01,
       -3.75970968e-01,  4.99953240e-01, -2.00067126e+00,  1.17170698e+00,
        1.96977724e+00,  1.03718508e+00, -6.53047241e-02, -4.45021028e-01,
        9.39119027e-01, -1.10428667e+00,  1.41412970e+00, -4.01334837e-01,
       -6.16368346e-01, -6.90025514e-02, -3.77017848e-01, -3.63643351e-01,
       -2.84866934e-01,  5.92537561e-01, -2.38113788e+00,  1.09843280e+00,
       -1.14683848e-01,  1.30455981e+00,  2.02613763e-01,  3.33268987e-01,
       -8.78240931e-01,  1.80940850e+00,  3.81353156e-02, -3.56889589e-01,
       -4.21078687e-01, -2.29575950e-01, -1.08930614e-02, -8.51462439e-01,
       -1.64150937e+00, -1.72462767e+00,  9.06444371e-01,  1.08649415e+00,
       -2.00391584e-01, -1.24344481e+00,  1.06333971e+00,  5.44663674e-01,
        6.76364202e-01, -1.41357317e+00, -1.13077204e+00, -1.18572851e-01,
        4.75770946e-01,  3.20072740e-01, -6.70650610e-01, -2.05068962e-01,
        3.17709759e+00,  3.98700147e-01,  7.05627774e-01,  4.09379281e-01,
        1.25655345e+00, -3.13593158e-01,  1.35907583e+00,  8.24579972e-01,
        7.37154562e-01,  7.43706049e-01, -4.95939655e-01, -8.76624962e-01,
        9.41825312e-01,  4.48479323e-01,  6.71811547e-01,  6.16846430e-01,
        1.22515748e+00,  1.40567131e+00,  2.87221036e-01,  2.21148955e-01,
       -1.74094633e+00, -1.35783304e+00,  1.97183990e+00, -1.01893086e+00,
       -1.52314626e+00,  5.38237035e-01, -3.72218859e-01,  4.09847983e-01,
        3.33788350e-01, -1.71183865e-01,  1.92046193e+00,  1.22743600e-01,
        7.81285071e-01,  7.36914075e-01, -6.27588378e-01, -2.53122284e-01,
        1.18825774e+00, -2.51027482e-01, -5.10374199e-01,  2.33884207e-01,
       -1.02285278e+00, -6.18157389e-01, -2.31685673e-01, -1.00720414e+00,
        8.08518643e-01, -7.64351966e-01,  1.58542527e-01, -1.05336071e+00,
        8.13269142e-01,  8.88334918e-01,  5.80236851e-01, -1.52170851e+00,
       -3.61736895e-01, -6.41886184e-01, -5.16940148e-02, -4.48446226e-01,
        4.73189690e-01, -2.81700125e-01, -7.56567047e-01,  1.24702200e+00,
       -1.57137487e-01,  1.02142095e+00, -2.30510969e-01,  1.41594737e+00,
        2.70174719e-01,  9.61201234e-01, -1.13386232e+00, -1.43342988e+00,
        1.51593609e-01, -1.07610528e+00, -2.26612781e-01, -9.00265046e-01,
        1.11393754e+00, -1.35693672e+00, -2.56505751e-01,  8.99182449e-02,
       -4.04286849e-01,  8.15378429e-01,  1.61990524e+00, -9.87844324e-01,
       -2.64444868e+00,  9.17445943e-02,  4.50007993e-01,  1.89366478e+00,
       -2.26428337e-01, -6.41466406e-01,  9.12342467e-01, -9.76270743e-01,
       -2.51562559e-01,  1.33871613e+00, -6.97167804e-01,  1.13474028e+00,
        2.17270340e-01, -1.67063244e+00, -1.99803255e-01,  4.03981796e-01,
        2.67591302e-01, -8.68810700e-02, -1.68582905e+00, -2.15396989e-01,
       -6.70474984e-01, -9.00566341e-01, -6.74367690e-01, -5.61885233e-02,
       -3.86899516e-01, -1.19266806e+00, -1.12785442e+00,  4.52600033e-01,
       -5.34562688e-01,  6.90766021e-01,  2.53634520e-01,  2.68212672e-01,
        5.25484987e-01,  4.77012273e-01,  2.04300446e-01,  1.62653485e-01,
       -8.18744629e-01, -2.19898667e-01, -1.30482674e+00,  1.03267328e+00,
        1.27494100e+00,  1.35846284e+00,  8.80877451e-01, -7.40731197e-01,
        1.29054015e-01, -2.65664713e-01,  6.70684820e-01,  9.41642982e-02,
        1.03469529e+00, -3.13627639e-01, -2.34642279e-01,  9.88918662e-02,
        1.32597320e-01, -1.92856092e+00,  7.20593981e-01, -8.90788059e-02,
       -7.61953399e-01,  2.56922780e-01, -8.87104518e-01,  3.25669272e-02,
        1.17612591e+00,  6.03447675e-01, -7.06586033e-01,  1.03855459e+00,
       -3.77325366e-01, -1.23066051e+00,  2.15445570e+00,  2.52362032e+00,
        1.35377440e+00,  7.17033114e-01, -1.94219801e-01,  7.75010332e-01,
        1.60160672e-01, -1.22531021e+00,  5.20253058e-01, -9.88665011e-01,
       -5.46835874e-01, -4.46332669e-02, -8.18408166e-01,  1.11165108e+00,
       -3.12019131e-01, -7.59659023e-01,  1.28919008e+00,  7.68100167e-01,
       -5.54514427e-01,  1.70205763e-01, -1.30270948e-02,  3.58716904e-01,
       -1.17441454e+00, -1.94613365e+00,  7.93275053e-01, -7.11303761e-02,
       -1.98428701e+00,  1.46078836e+00, -2.45813675e-01,  1.10655004e+00,
       -9.04734369e-01, -1.49269425e+00, -4.55509190e-01, -2.21993983e+00,
       -1.07995397e+00, -6.74709074e-01,  9.07701003e-01, -2.46695051e-01,
        1.21076729e+00,  1.55765044e-01,  9.25430311e-01, -3.93018877e-01,
       -2.66870660e-01,  1.04543074e+00, -1.37344243e+00,  1.01804833e+00,
        1.08495916e+00, -1.48626414e+00, -3.47262371e-01, -1.02551076e-01])

In [352]:
cats = pd.qcut(data, 4) # Cut into quartiles
cats

[(-0.033, 0.717], (-0.677, -0.033], (-0.033, 0.717], (-3.21, -0.677], (-0.033, 0.717], ..., (0.717, 3.177], (0.717, 3.177], (-3.21, -0.677], (-0.677, -0.033], (-0.677, -0.033]]
Length: 1000
Categories (4, interval[float64]): [(-3.21, -0.677] < (-0.677, -0.033] < (-0.033, 0.717] < (0.717, 3.177]]

In [353]:
pd.value_counts(cats)

(0.717, 3.177]      250
(-0.033, 0.717]     250
(-0.677, -0.033]    250
(-3.21, -0.677]     250
dtype: int64

Similar to cut you can pass your own quantiles (numbers between 0 and 1, inclusive):

In [354]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.033, 1.298], (-1.196, -0.033], (-0.033, 1.298], (-1.196, -0.033], (-0.033, 1.298], ..., (-0.033, 1.298], (-0.033, 1.298], (-3.21, -1.196], (-1.196, -0.033], (-1.196, -0.033]]
Length: 1000
Categories (4, interval[float64]): [(-3.21, -1.196] < (-1.196, -0.033] < (-0.033, 1.298] < (1.298, 3.177]]

## 11.6_Detecting and Filtering Outliers

Filtering or transforming outliers is largely a matter of applying array operations.
Consider a DataFrame with some normally distributed data:

In [355]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0   -0.290374 -0.775881  0.423285 -0.783194
1   -0.535236 -0.578446  0.455142  2.080045
2    1.451696 -0.407364  0.719301  1.602676
3    0.833663  0.077783  1.637331 -0.678302
4    0.070605  0.789985 -2.542495  0.937492
..        ...       ...       ...       ...
995  0.767667  0.476232 -1.515344 -0.978532
996  0.325519  0.170750 -0.741530 -0.007720
997  0.048692  0.013198 -1.106265 -1.262202
998  0.834665  2.176275  0.619214  0.297568
999  1.116435 -0.802598  1.059431  0.987886

[1000 rows x 4 columns]

In [356]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.029327     0.014016     0.005484    -0.003049
std       0.967358     0.986493     1.012483     1.012181
min      -2.890512    -3.046349    -3.289264    -3.893559
25%      -0.711596    -0.632301    -0.684741    -0.683054
50%      -0.047913     0.036391     0.044203     0.013930
75%       0.608205     0.661205     0.713800     0.725790
max       3.180108     3.138730     2.838521     2.811652

In [357]:
col = data[2]

In [358]:
col[np.abs(col) > 3]

72    -3.289264
140   -3.048591
Name: 2, dtype: float64

In [360]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
72  -0.965058  1.059430 -3.289264 -1.257503
118  3.062732  0.570296  1.230514  0.282871
140 -0.810542  0.822248 -3.048591  0.210282
240 -0.821170 -1.171275  0.221785 -3.135704
468  3.180108 -0.402980 -0.862729  0.239309
..        ...       ...       ...       ...
690  0.763587  3.127964 -0.070410 -0.341885
695  1.542113 -0.254304 -0.741353 -3.153870
791  0.344213 -0.729437  0.176502 -3.893559
827 -0.559442  3.138730  1.033579  2.553846
912  3.071138  2.745563 -0.774858  0.800570

[11 rows x 4 columns]

Values can be set based on these criteria. Here is code to cap values outside the interval
–3 to 3:

In [361]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [363]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.029641     0.013796     0.005822    -0.001866
std       0.966352     0.985524     1.011436     1.008251
min      -2.890512    -3.000000    -3.000000    -3.000000
25%      -0.711596    -0.632301    -0.684741    -0.683054
50%      -0.047913     0.036391     0.044203     0.013930
75%       0.608205     0.661205     0.713800     0.725790
max       3.000000     3.000000     2.838521     2.811652

The statement np.sign(data) produces 1 and –1 values based on whether the values
in data are positive or negative:

In [364]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1 -1.0 -1.0  1.0  1.0
2  1.0 -1.0  1.0  1.0
3  1.0  1.0  1.0 -1.0
4  1.0  1.0 -1.0  1.0

## 11.7_Permutation and Random Sampling

Permuting (randomly reordering) a Series or the rows in a DataFrame is easy to do
using the numpy.random.permutation function. Calling permutation with the length
of the axis you want to permute produces an array of integers indicating the new
ordering:

In [366]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5,4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [367]:
sampler = np.random.permutation(5)
sampler

array([2, 3, 1, 4, 0])

In [368]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3

In [369]:
df.sample(n = 3)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11

In [370]:
choices = pd.Series([5, 7, -1, 6, 4])

In [371]:
draws = choices.sample(n = 10, replace = True)
draws

1    7
4    4
0    5
2   -1
2   -1
3    6
3    6
0    5
4    4
4    4
dtype: int64

## 11.8_Computing Indicator/Dummy Variables

Another type of transformation for statistical modeling or machine learning applications
is converting a categorical variable into a “dummy” or “indicator” matrix. If a
column in a DataFrame has k distinct values, you would derive a matrix or Data‐
Frame with k columns containing all 1s and 0s. pandas has a get_dummies function
for doing this, though devising one yourself is not difficult. Let’s return to an earlier
example DataFrame:

In [372]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [374]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In some cases, you may want to add a prefix to the columns in the indicator Data‐
Frame, which can then be merged with the other data. get_dummies has a prefix argument
for doing this:

In [375]:
dummies = pd.get_dummies(df['key'], prefix = 'key')

In [376]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [384]:
mnames = ['movie_id', 'title', 'genres']

In [385]:
movies = pd.read_table('datasets/movies.dat', sep='::',
                       header=None, names=mnames)

<ipython-input-385-dd95626eecfc>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('datasets/movies.dat', sep='::',

In [386]:
all_genres = []

In [387]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [388]:
genres = pd.unique(all_genres)
genres

array(['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Mystery', 'Sci-Fi', 'IMAX', 'Documentary', 'War', 'Musical',
       'Film-Noir', 'Western', '(no genres listed)'], dtype=object)

In [390]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [391]:
dummies = pd.DataFrame(zero_matrix, columns = genres)

In [392]:
gen = movies.genres[0]

In [393]:
gen.split('|')

['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy']

In [394]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2, 3, 4], dtype=int64)

In [395]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [396]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [397]:
movies_windic.iloc[0]

movie_id                                                              1
title                                                  Toy Story (1995)
genres                      Adventure|Animation|Children|Comedy|Fantasy
Genre_Adventure                                                       1
Genre_Animation                                                       1
                                               ...
Genre_War                                                             0
Genre_Musical                                                         0
Genre_Film-Noir                                                       0
Genre_Western                                                         0
Genre_(no genres listed)                                              0
Name: 0, Length: 23, dtype: object

In [398]:
np.random.seed(12345)

In [399]:
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [400]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [401]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 12_String Manipulation

Python has long been a popular raw data manipulation language in part due to its
ease of use for string and text processing. Most text operations are made simple with
the string object’s built-in methods. For more complex pattern matching and text
manipulations, regular expressions may be needed. pandas adds to the mix by enabling
you to apply string and regular expressions concisely on whole arrays of data,
additionally handling the annoyance of missing data.

## 12.1_String Object Methods

In [402]:
val = 'a,b, guido'

In [403]:
val.split(',')

['a', 'b', ' guido']

In [404]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [405]:
first, second, third = pieces

In [406]:
first + '::' + second + '::' + third

'a::b::guido'

In [407]:
'::'.join(pieces)

'a::b::guido'

In [408]:
'guido' in val

True

In [409]:
val.index(',')

1

In [410]:
val.find(':')

-1

Note the difference between find and index is that index raises an exception if the
string isn’t found (versus returning –1):

In [412]:
val.index(':')

ValueError: substring not found

In [413]:
val.count(',')

2

In [414]:
val.replace(',', '::')

'a::b:: guido'

In [415]:
val.replace(',', '')

'ab guido'

## 12.2_Regular Expressions

Regular expressions provide a flexible way to search or match (often more complex)
string patterns in text. A single expression, commonly called a regex, is a string
formed according to the regular expression language. Python’s built-in re module is
responsible for applying regular expressions to strings; I’ll give a number of examples
of its use here.

The re module functions fall into three categories: pattern matching, substitution,
and splitting. Naturally these are all related; a regex describes a pattern to locate in the
text, which can then be used for many purposes. Let’s look at a simple example:

In [416]:
import re

In [417]:
text = "foo bar\t baz \tqux"

In [418]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [419]:
regex = re.compile('\s+')

In [420]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [422]:
regex.findall(text)

[' ', '\t ', ' \t']

Creating a regex object with re.compile is highly recommended if you intend to
apply the same expression to many strings; doing so will save CPU cycles.
match and search are closely related to findall. While findall returns all matches
in a string, search returns only the first match. More rigidly, match only matches at
the beginning of the string. As a less trivial example, let’s consider a block of text and
a regular expression capable of identifying most email addresses:

In [423]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [424]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [426]:
m = regex.search(text)
m

In [427]:
text[m.start():m.end()]

'dave@google.com'

regex.match returns None, as it only will match if the pattern occurs at the start of the
string:

In [430]:
print(regex.match(text))

None

Relatedly, sub will return a new string with occurrences of the pattern replaced by the
a new string:

In [431]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

Suppose you wanted to find email addresses and simultaneously segment each
address into its three components: username, domain name, and domain suffix. To
do this, put parentheses around the parts of the pattern to segment:

In [432]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [433]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [434]:
m = regex.match('wesm@bright.net')

In [435]:
m.groups()

('wesm', 'bright', 'net')

In [436]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [437]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

## 12.3_Vectorized String Functions in pandas

Cleaning up a messy dataset for analysis often requires a lot of string munging and
regularization. To complicate matters, a column containing strings will sometimes
have missing data:

In [438]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [439]:
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [440]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [441]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [443]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [444]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [445]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [449]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

# 13_Hierarchical Indexing

Hierarchical indexing is an important feature of pandas that enables you to have multiple
(two or more) index levels on an axis. Somewhat abstractly, it provides a way for
you to work with higher dimensional data in a lower dimensional form. Let’s start
with a simple example; create a Series with a list of lists (or arrays) as the index:

In [450]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    1.007189
   2   -1.296221
   3    0.274992
b  1    0.228913
   3    1.352917
c  1    0.886429
   2   -2.001637
d  2   -0.371843
   3    1.669025
dtype: float64

In [451]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [452]:
data['b']

1    0.228913
3    1.352917
dtype: float64

In [453]:
data['b':'c']

b  1    0.228913
   3    1.352917
c  1    0.886429
   2   -2.001637
dtype: float64

In [454]:
data.loc[['b', 'd']]

b  1    0.228913
   3    1.352917
d  2   -0.371843
   3    1.669025
dtype: float64

In [455]:
data.loc[:, 2]

a   -1.296221
c   -2.001637
d   -0.371843
dtype: float64

Hierarchical indexing plays an important role in reshaping data and group-based
operations like forming a pivot table. For example, you could rearrange the data into
a DataFrame using its unstack method:

In [456]:
data.unstack()

          1         2         3
a  1.007189 -1.296221  0.274992
b  0.228913       NaN  1.352917
c  0.886429 -2.001637       NaN
d       NaN -0.371843  1.669025

In [457]:
data.unstack().stack()

a  1    1.007189
   2   -1.296221
   3    0.274992
b  1    0.228913
   3    1.352917
c  1    0.886429
   2   -2.001637
d  2   -0.371843
   3    1.669025
dtype: float64

In [458]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [459]:
frame.index.names = ['key1', 'key2']

In [460]:
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [461]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

## 13.1_Reordering and Sorting Levels

At times you will need to rearrange the order of the levels on an axis or sort the data
by the values in one specific level. The swaplevel takes two level numbers or names
and returns a new object with the levels interchanged (but the data is otherwise
unaltered):

In [462]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [463]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [464]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [465]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [466]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

## 13.2_Indexing with a DataFrame’s columns

It’s not unusual to want to use one or more columns from a DataFrame as the row
index; alternatively, you may wish to move the row index into the DataFrame’s columns.
Here’s an example DataFrame:

In [467]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two',
                            'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [469]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [470]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [471]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

# 14_Combining and Merging Datasets

Data contained in pandas objects can be combined together in a number of ways:
• pandas.merge connects rows in DataFrames based on one or more keys. This
will be familiar to users of SQL or other relational databases, as it implements
database join operations.
• pandas.concat concatenates or “stacks” together objects along an axis.
• The combine_first instance method enables splicing together overlapping data
to fill in missing values in one object with values from another.

## 14.1_Database-Style DataFrame Joins

Merge or join operations combine datasets by linking rows using one or more keys.
These operations are central to relational databases (e.g., SQL-based). The merge
function in pandas is the main entry point for using these algorithms on your data.
Let’s start with a simple example:

In [472]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})

df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})

In [473]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [474]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [475]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [476]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [477]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})

df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})

In [478]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [479]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [480]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                    'data1': range(6)})

df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                    'data2': range(5)})

In [481]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [482]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [483]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
..  ..    ...    ...
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

[11 rows x 3 columns]

In [484]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [485]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})

right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})

In [486]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

A last issue to consider in merge operations is the treatment of overlapping column
names. While you can address the overlap manually (see the earlier section on
renaming axis labels), merge has a suffixes option for specifying strings to append
to overlapping names in the left and right DataFrame objects:

In [487]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [488]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

## 14.2_Merging on Index

In some cases, the merge key(s) in a DataFrame will be found in its index. In this
case, you can pass left_index=True or right_index=True (or both) to indicate that
the index should be used as the merge key:

In [489]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': range(6)})

right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [490]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [491]:
right1

   group_val
a        3.5
b        7.0

In [492]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [493]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [494]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
                               'Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': np.arange(5.)})

righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                      index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',
                              'Ohio', 'Ohio'],
                             [2001, 2000, 2000, 2000, 2001, 2002]],
                      columns=['event1', 'event2'])

In [495]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [496]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [497]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [498]:
pd.merge(lefth, righth, left_on=['key1', 'key2'],
         right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [499]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     index=['a', 'c', 'e'],
                     columns=['Ohio', 'Nevada'])

right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                      index=['b', 'c', 'd', 'e'],
                      columns=['Missouri', 'Alabama'])

In [500]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [501]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [502]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

DataFrame has a convenient join instance for merging by index. It can also be used
to combine together many DataFrame objects having the same or similar indexes but
non-overlapping columns. In the prior example, we could have written:

In [503]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In part for legacy reasons (i.e., much earlier versions of pandas), DataFrame’s join
method performs a left join on the join keys, exactly preserving the left frame’s row
index. It also supports joining the index of the passed DataFrame on one of the columns
of the calling DataFrame:

In [504]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [505]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                       index=['a', 'c', 'e', 'f'],
                       columns=['New York', 'Oregon'])
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [506]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [507]:
left2.join([right2, another], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0
b   NaN     NaN       7.0      8.0       NaN     NaN
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      16.0    17.0

## 14.3_Concatenating Along an Axis

In [508]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [509]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In the context of pandas objects such as Series and DataFrame, having labeled axes
enable you to further generalize array concatenation. In particular, you have a number
of additional things to think about:
• If the objects are indexed differently on the other axes, should we combine the
distinct elements in these axes or use only the shared values (the intersection)?
• Do the concatenated chunks of data need to be identifiable in the resulting
object?
• Does the “concatenation axis” contain data that needs to be preserved? In many
cases, the default integer labels in a DataFrame are best discarded during
concatenation.

In [510]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [511]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [512]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [514]:
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [515]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [516]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [519]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [520]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [521]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [522]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                   columns=['one', 'two'])

df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
                   columns=['three', 'four'])

In [523]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [524]:
df2

   three  four
a      5     6
c      7     8

In [525]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [526]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [527]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],
          names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [528]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])

df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [529]:
df1

          a         b         c         d
0 -0.438570 -0.539741  0.476985  3.248944
1 -1.021228 -0.577087  0.124121  0.302614
2  0.523772  0.000940  1.343810 -0.713544

In [530]:
df2

          b         d         a
0 -0.831154 -2.370232 -1.860761
1 -0.860757  0.560145 -1.265934

In [531]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0 -0.438570 -0.539741  0.476985  3.248944
1 -1.021228 -0.577087  0.124121  0.302614
2  0.523772  0.000940  1.343810 -0.713544
3 -1.860761 -0.831154       NaN -2.370232
4 -1.265934 -0.860757       NaN  0.560145

## 14.4_Combining Data with Overlap

There is another data combination situation that can’t be expressed as either a merge
or concatenation operation. You may have two datasets whose indexes overlap in full
or part. As a motivating example, consider NumPy’s where function, which performs
the array-oriented equivalent of an if-else expression:

In [532]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
              index=['f', 'e', 'd', 'c', 'b', 'a'])

b = pd.Series(np.arange(len(a), dtype=np.float64),
              index=['f', 'e', 'd', 'c', 'b', 'a'])

In [533]:
b[-1] = np.nan

In [534]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [535]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [536]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [537]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [538]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
                    'b': [np.nan, 2., np.nan, 6.],
                    'c': range(2, 18, 4)})

df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
                    'b': [np.nan, 3., 4., 6., 8.]})

In [539]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [540]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [541]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

# 15_Reshaping and Pivoting

There are a number of basic operations for rearranging tabular data. These are alternatingly
referred to as reshape or pivot operations.

## 15.1_Reshaping with Hierarchical Indexing

Hierarchical indexing provides a consistent way to rearrange data in a DataFrame.
There are two primary actions:
    
stack
This “rotates” or pivots from the columns in the data to the rows

unstack
This pivots from the rows into the columns

I’ll illustrate these operations through a series of examples. Consider a small Data‐
Frame with string arrays as row and column indexes:

In [542]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'],
                    name='number'))

In [543]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [545]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [546]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [547]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [548]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [549]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

In [550]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [551]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [552]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [553]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [554]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [555]:
df = pd.DataFrame({'left': result, 'right': result + 5},
                  columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [556]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [557]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

## 15.2_Pivoting “Long” to “Wide” Format

A common way to store multiple time series in databases and CSV is in so-called long
or stacked format. Let’s load some example data and do a small amount of time series
wrangling and other data cleaning:

In [558]:
data = pd.read_csv('examples/macrodata.csv')

In [559]:
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [560]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter,
                         name='date')

In [561]:
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')

In [562]:
data = data.reindex(columns=columns)

In [563]:
data.index = periods.to_timestamp('D', 'end')

In [564]:
ldata = data.stack().reset_index().rename(columns={0: 'value'})

In [565]:
ldata[:10]

                           date     item     value
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340
5 1959-06-30 23:59:59.999999999    unemp     5.100
6 1959-09-30 23:59:59.999999999  realgdp  2775.488
7 1959-09-30 23:59:59.999999999     infl     2.740
8 1959-09-30 23:59:59.999999999    unemp     5.300
9 1959-12-31 23:59:59.999999999  realgdp  2785.204

Data is frequently stored this way in relational databases like MySQL, as a fixed
schema (column names and data types) allows the number of distinct values in the
item column to change as data is added to the table. In the previous example, date
and item would usually be the primary keys (in relational database parlance), offering
both relational integrity and easier joins. In some cases, the data may be more difficult
to work with in this format; you might prefer to have a DataFrame containing
one column per distinct item value indexed by timestamps in the date column. Data‐
Frame’s pivot method performs exactly this transformation:

In [566]:
pivoted = ldata.pivot('date', 'item', 'value')
pivoted

item                           infl    realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00   2710.349    5.8
1959-06-30 23:59:59.999999999  2.34   2778.801    5.1
1959-09-30 23:59:59.999999999  2.74   2775.488    5.3
1959-12-31 23:59:59.999999999  0.27   2785.204    5.6
1960-03-31 23:59:59.999999999  2.31   2847.699    5.2
...                             ...        ...    ...
2008-09-30 23:59:59.999999999 -3.16  13324.600    6.0
2008-12-31 23:59:59.999999999 -8.79  13141.920    6.9
2009-03-31 23:59:59.999999999  0.94  12925.410    8.1
2009-06-30 23:59:59.999999999  3.37  12901.504    9.2
2009-09-30 23:59:59.999999999  3.56  12990.341    9.6

[203 rows x 3 columns]

In [567]:
ldata['value2'] = np.random.randn(len(ldata))

In [568]:
ldata[:10]

                           date     item     value    value2
0 1959-03-31 23:59:59.999999999  realgdp  2710.349  0.119827
1 1959-03-31 23:59:59.999999999     infl     0.000 -1.063512
2 1959-03-31 23:59:59.999999999    unemp     5.800  0.332883
3 1959-06-30 23:59:59.999999999  realgdp  2778.801 -2.359419
4 1959-06-30 23:59:59.999999999     infl     2.340 -0.199543
5 1959-06-30 23:59:59.999999999    unemp     5.100 -1.541996
6 1959-09-30 23:59:59.999999999  realgdp  2775.488 -0.970736
7 1959-09-30 23:59:59.999999999     infl     2.740 -1.307030
8 1959-09-30 23:59:59.999999999    unemp     5.300  0.286350
9 1959-12-31 23:59:59.999999999  realgdp  2785.204  0.377984

In [569]:
pivoted = ldata.pivot('date', 'item')
pivoted[:5]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8 -1.063512  0.119827
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1 -0.199543 -2.359419
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3 -1.307030 -0.970736
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6 -0.753887  0.377984
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2  0.069877  1.349742


item                              unemp
date
1959-03-31 23:59:59.999999999  0.332883
1959-06-30 23:59:59.999999999 -1.541996
1959-09-30 23:59:59.999999999  0.286350
1959-12-31 23:59:59.999999999  0.331286
1960-03-31 23:59:59.999999999  0.246674

In [570]:
pivoted['value'][:5]

item                           infl   realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00  2710.349    5.8
1959-06-30 23:59:59.999999999  2.34  2778.801    5.1
1959-09-30 23:59:59.999999999  2.74  2775.488    5.3
1959-12-31 23:59:59.999999999  0.27  2785.204    5.6
1960-03-31 23:59:59.999999999  2.31  2847.699    5.2

In [571]:
unstacked = ldata.set_index(['date', 'item']).unstack('item')
unstacked[:7]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8 -1.063512  0.119827
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1 -0.199543 -2.359419
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3 -1.307030 -0.970736
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6 -0.753887  0.377984
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2  0.069877  1.349742
1960-06-30 23:59:59.999999999  0.14  2834.390   5.2  1.004812 -0.011862
1960-09-30 23:59:59.999999999  2.70  2839.022   5.6 -1.549106 -0.919262


item                              unemp
date
1959-03-31 23:59:59.999999999  0.332883
1959-06-30 23:59:59.999999999 -1.541996
1959-09-30 23:59:59.999999999  0.286350
1959-12-31 23:59:59.999999999  0.331286
1960-03-31 23:59:59.999999999  0.246674
1960-06-30 23:59:59.999999999  1.327195
1960-09-30 23:59:59.999999999  0.022185

## 15.3_Pivoting “Wide” to “Long” Format

An inverse operation to pivot for DataFrames is pandas.melt. Rather than transforming
one column into many in a new DataFrame, it merges multiple columns into
one, producing a DataFrame that is longer than the input. Let’s look at an example:

In [572]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
                   'A': [1, 2, 3],
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})

In [573]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [575]:
melted = pd.melt(df, ['key'])
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [576]:
reshaped = melted.pivot('key', 'variable', 'value')
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [577]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [578]:
pd.melt(df, id_vars=['key'], value_vars=['A', 'B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [579]:
pd.melt(df, value_vars=['A', 'B', 'C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [580]:
pd.melt(df, value_vars=['key', 'A', 'B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6